# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [14]:
df_first = pd.Series(np.random.randint(1,high=5,size=100,dtype = 'l'))
df_sec = pd.Series(np.random.randint(1,high = 4 ,size =100 ,dtype ='l'))
df_third = pd.Series (np.random.randint(10000 , high = 30001 ,size =100, dtype = 'l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [25]:
df = pd.concat([df_first,df_sec ,df_third],axis=1)
df.head()

   0  1      2
0  4  2  25895
1  1  3  12722
2  2  3  11617
3  3  1  11124
4  3  3  28277

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [26]:
df.rename(columns={0:'bedrs', 1:'bathrs', 2 :'price_sqr_mete'},inplace=True)

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [38]:
bigcolumn = pd.concat([df_first , df_sec , df_third])
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       4
1       1
2       2
3       3
4       3
..    ...
95  27701
96  29616
97  20327
98  15460
99  22811

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [53]:
if len(bigcolumn.index)== 99:
    Print('True')
else:
    print(len(bigcolumn.index))

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [56]:

bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        1
2        2
3        3
4        3
..     ...
295  27701
296  29616
297  20327
298  15460
299  22811

[300 rows x 1 columns]